{
  "conversationHistory": {},
  "triviaRanking": {},
  "personalPPMRecords": {},
  "reactionStats": {},
  "reactionWins": {},
  "activeSessions": {},
  "triviaStats": {},
  "musicSessions": {},
  "recordatorios": [
    {
      "id": "2d699ff3-0832-4996-80b9-8dce8ec74a20",
      "userId": "1023132788632862761",
      "channelId": "1343749554905940058",
      "mensaje": "recuérdame retirar una torta",
      "timestamp": 1742160697011,
      "creado": 1742159497012,
      "esRecurrente": false,
      "hora": null,
      "minutos": null
    },
    {
      "id": "eeee86d5-4cef-4d91-9e0b-f04fbb95fde0",
      "userId": "1023132788632862761",
      "channelId": "1343749554905940058",
      "mensaje": "recuérdame ir a la farmacia",
      "timestamp": 1742163104955,
      "creado": 1742159504956,
      "esRecurrente": false,
      "hora": null,
      "minutos": null
    }
  ],
  "updatesSent": false,
  "adivinanzaStats": {},
  "utilMessageTimestamps": {
    "util_1343749554905940058": 1742159415681
  },
  "utilMessageReactions": {},
  "sentUpdates": [
    "¡Chat mejorado! Segunda respuesta automática al darle ❌, pa’ que sea más bacán y no pida detalles de una.",
    "Optimizado el código un poco, si te gustaría agregar algo más puedes solicitarlo, espero este bot cumpla con tus expectativas.",
    "Mayúsculas bloqueadas en el canal de texto.",
    "!autosave funcional, cuando no quieras que falle o cualquier cosa lo haces, esto hará que no falle nada, ni se reinicie el bot.",
    "!save funcional, haz el guardado al instante por si quieres asegurarte que todo se conservará.",
    "!reacciones ahora va como trivia: una palabra tras otra hasta que lo parás con !re o fallás, ¡a meterle velocidad, che!",
    "!ppm cambiado: si te equivocás o se te pasa el tiempo, te tira otra frase; si la hacés bien, termina ahí, ¡posta!",
    "!resp / !responder metido: para poder recibir ayuda en lo que necesites, ¡posta!",
    "¡Trivia, reacciones y PPM ahora con cancelación posta! Usá !tc, !rc o !pc pa’ parar al toque sin quilombo.",
    "Miguel (OWNER_ID) ahora puede usar todos los comandos y participar en los juegos, ¡a romperla, loco!",
    "Ranking (!rk) mejorado: muestra a Miguel y Belén, ordenados por quién tiene más puntos en trivia, PPM y reacciones.",
    "¡Reacciones arregladas! Ahora se cancelan bien con !rc y no siguen tirando mensajes después de parar.",
    "¡Nuevo !idea agregado! Tirale ideas al bot con !id y las manda solo a Miguel por MD, ¡posta!",
    "Sincronizado triviaRanking con triviaStats pa’ que los puntajes sean posta y no haya más errores raros en el ranking.",
    "**LO NUEVO**",
    "¡Nuevo !dato / !dt agregado! Busco datos rápidos en la web o X pa’ que sepas todo al toque.",
    "¡Clima al toque con !clima! Te digo cómo está el tiempo en cualquier ciudad, ideal pa’l asado o el mate.",
    "¡Noticias rápidas con !noticias! Te traigo el último titular de Argentina, re copado.",
    "¡Wiki Bot con !wiki! Busco resúmenes en Wikipedia pa’ que aprendas sin esfuerzo.",
    "¡Traductor piola con !traducí! Traduzco frases cortas a cualquier idioma, joya pa’ practicar.",
    "¡Oliver ahora se acuerda de las últimas 20 charlas, posta! Preguntale lo que sea con !chat y sigue la onda como amigo piola.",
    "El mensaje diario a Belén ahora se envía una vez por día y respeta las reacciones ✅ o ❌ pa' no spamear. Si reacciona, no se repite hasta mañana, ¡posta!",
    "¡Arreglado la opción de segunda respuestas cuando reaccionás con ❌! Más rápido y copado, loco.",
    "¡Nuevo !imagen / !im agregado! Generá imágenes zarpadas con Stable Diffusion, pedí lo que quieras (ej. !imagen un mate [cartoon]) y confirmá con ✅, loco.",
    "¡Historial de imágenes con !misimagenes / !mi! Mirá tus últimas 5 imágenes generadas con sus IDs, pa’ que no pierdas nada, che.",
    "¡Edición piola con !editarimagen / !ei! Modificá tus imágenes guardadas (ej. !editarimagen [ID] agregar un perro), solo las que hice yo, ¡posta!",
    "¡Solucionado el error con las imágenes, ahora sí funciona como la puta madre!",
    "¡Nuevo !ansiedad / !an agregado! Consejos rápidos pa’ calmar la ansiedad, con un mensaje zarpado de Miguel pa’ darte pilas, ¡genia!",
    "¡Nuevo !milagros revisa tus nombres en diferente idioma de buena onda pa’ hacerla sonreír, ¡re milagroso, che!",
    "¡Nuevo comando !avatar pa’ que Miguel y Belén me cambien la cara!",
    "Agregado embeds copados pa’ que todo se vea más lindo.",
    "¡Nuevo juego! Usá !jugar pa’ adivinar un número y sacarte el aburrimiento, loco.",
    "¡Memes al toque! Con !meme te traigo uno random pa’ reírte un rato.",
    "¡Charla loca! Usá !pregunta y te tiro una pregunta random pa’ que nos copemos charlando.",
    "¡Preguntas a full! La lista de !pregunta pasó de 30 a 150, pa’ que no te aburras nunca, posta.",
    "¡Memes con yapa! Ahora con !meme te traigo puros memes en español pa’ que le des rosca.",
    "Agregado !pr, Che.",
    "¡Música a full! Mejoramos las funciones de música: ahora podés tirar enlaces de playlists de YouTube y Spotify sin drama, y sumamos el comando !shuffle pa’ revolver la cola como loco.",
    "¡Le metimos pilas al bot, che! Ahora podés jugar Piedra, Papel o Tijera y romperla toda:",
    "- !ppt [piedra/papel/tijera]: Jugá contra mí, el bot más grosso del condado. Elegí tu jugada y vemos quién la pica, ¡dale!",
    "- !ppt @alguien: Desafiá a un amigo a un duelo épico. Reacciona con ✅ pa’ aceptar, mandá tu elección por MD y que gane el mejor, ¡posta!",
    "¡Nuevo !recordatorio / !rec agregado! Te hago acordar lo que sea cuando quieras. Ejemplo: \"!rec 'comprar sanduche de miga' en 1 hora\" o \"!rec 'llamar a Miguel' mañana 14:30\", ¡posta!",
    "¡Boss bar al 100%! Arreglamos la barra de progreso pa’ que llegue al final posta y se vea zarpada cuando termina el tema, ¡a romperla, che!",
    "¡Datos randoms en !dato! Ahora si no le das argumentos, te tira un dato curioso al azar con onda, ¡re copado pa’ sorprenderte, loco!",
    "¡Nuevo !chiste agregado! Usá !chiste y te tiro un chiste random pa’ que te rías a lo grande, ¡posta que la rompés, che!",
    "¡Nuevo !adivinanza / !ad agregado! Te tiro adivinanzas copadas pa’ que le des al coco, con 30 segundos pa’ responder, ¡dale, genia!",
    "¡Ranking con adivinanzas! Ahora en !rk se ven tus aciertos y porcentaje en adivinanzas, pa’ que veas quién la rompe más, ¡posta!",
    "¡Recordatorios a full! Ahora con !rec podés setear recordatorios diarios tipo !rec tomar mate todos los días 08:00, ¡posta que no me olvido, che!",
    "¡Lista de recordatorios con !misrecordatorios / !mr! Mirá tus recordatorios activos al toque, re útil pa’ no perderte nada, loco.",
    "¡Cancelación de recordatorios con !cancelarrecordatorio / !cr! Borra un recordatorio con su ID (lo ves en !mr), ¡al toque y sin drama!"
  ]
}